---
kind: method
id: M:Autodesk.Revit.DB.Element.GetSubelements
zh: 构件、图元、元素
source: html/feabfd59-bd0f-ab61-34a1-d0d22f58c881.htm
---
# Autodesk.Revit.DB.Element.GetSubelements Method

**中文**: 构件、图元、元素

Returns the collection of element subelements.

## Syntax (C#)
```csharp
public IList<Subelement> GetSubelements()
```

## Returns
The collection of element subelements.

## Remarks
This collection will not include the Element itself.